---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.FlexPipe
source: html/22b56931-ade4-178f-e118-7a0e436a2fbb.htm
---
# FlexPipe Properties

The id of the assembly instance to which the element belongs.